function [q,v] = GZrainstorm(t, area)
%GZrainstorm 此处显示有关此函数的摘要
%   设计50年一遇暴雨，采用芝加哥雨型生成降雨过程曲线
%    峰值r=0.5
%    q为瞬时暴雨强度，单位为L/(s·h㎡)
%    v为瞬时降雨速率，单位已换算为L/s
%    由于原函数不可逆，使用q = 167 * 8.8828.*(t+0.4).^(-0.806)拟合原函数
% P = 50;
% r = 0.5;
% n = 0.775 - 0.047 * log(P - 6.565);
% b = 12.547 - 1.681 * log(P - 8.255);
% A = 30.960 - 2.489 * log(P - 8.666);
% a = 167 * A;
% q = (a*((1-n)*(t-60)/(1-r)+b)/(((t-60)/(1-r)+b)^(1+n)));
q = 8.8828.*(t-60+0.4).^(-0.806);%单位为mm/min
q = 167 * q;%单位为L/(s·h㎡)
v = q * (area / 10000);%单位为L/s
end

